package second;

public class info {
    /**
     * 1) Класс - представляет собой описание объекта и его методов.
     *
     * 2) Объект - экземпляр класса.
     *
     * 3) Поля класса - переменные класса. Все данные объекта хранятся в его полях.
     *
     * 4) Метод - набор операторов, которые выполняют определенные действия.
     *
     * 5) "Сколько можно создать полей класса?" - ∞
     *
     * 6) "Каких типов данных могут быть поля класса?" - любых
     *
     * 7) Есть следующий класс. Как создать объект?
     * public class Auto {
     *
     *     public String model;
     *     public int speed;
     *      Auto citroen = new Auto(); //создание объекта
     * }
     *
     * 8) "Как обратиться к содержимому объекта и занести какое-нибудь значение?" -
     *         citroen.model = "c4"; //название объекта.название поля
     *
     * 9) "Как вывести содержимое объекта на консоль" -
     *      System.out.println( citroen.model );
     *
     */
}
